{
  "100": { "message": "Continue", "description": "This interim response indicates that the client should continue the request or ignore the response if the request is already finished." },
  "101": { "message": "Switching Protocols", "description": "This code is sent in response to an Upgrade request header from the client and indicates the protocol the server is switching to." },
  "102": { "message": "Processing", "description": "This code indicates that the server has received and is processing the request, but no response is available yet." },
  "103": { "message": "Early Hints", "description": "" },

  "200": { "message": "OK", "description": "The request succeeded." },
  "201": { "message": "Created", "description": "The request succeeded, and a new resource was created as a result." },
  "202": { "message": "Accepted", "description": "The request has been received but not yet acted upon." },
  "203": { "message": "Non-Authoritative Information", "description": "This response code means the returned metadata is not exactly the same as is available from the origin server, but is collected from a local or a third-party copy." },
  "204": { "message": "No Content", "description": "There is no content to send for this request, but the headers may be useful." },
  "205": { "message": "Reset Content", "description": "Tells the user agent to reset the document which sent this request." },
  "206": { "message": "Partial Content", "description": "This response code is used when the Range header is sent from the client to request only part of a resource." },
  "207": { "message": "Multi-Status", "description": "Conveys information about multiple resources, for situations where multiple status codes might be appropriate." },
  "208": { "message": "Already Reported", "description": "Used inside a <dav:propstat> response element to avoid repeatedly enumerating the internal members of multiple bindings to the same collection." },
  "226": { "message": "IM Used", "description": "The server has fulfilled a GET request for the resource, and the response is a representation of the result of one or more instance-manipulations applied to the current instance." },

  "300": { "message": "Multiple Choices", "description": "The request has more than one possible response." },
  "301": { "message": "Moved Permanently", "description": "The URL of the requested resource has been changed permanently." },
  "302": { "message": "Found", "description": "This response code means that the URI of requested resource has been changed temporarily." },
  "303": { "message": "See Other", "description": "The server sent this response to direct the client to get the requested resource at another URI with a GET request." },
  "304": { "message": "Not Modified", "description": "This is used for caching purposes." },
  "305": { "message": "Use Proxy", "description": "Defined in a previous version of the HTTP specification to indicate that a requested response must be accessed by a proxy." },
  "306": { "message": "Switch Proxy (Unused)", "description": "This response code is no longer used; it is just reserved." },
  "307": { "message": "Temporary Redirect", "description": "The server sends this response to direct the client to get the requested resource at another URI with the same method that was used in the prior request." },
  "308": { "message": "Permanent Redirect", "description": "This means that the resource is now permanently located at another URI, specified by the Location: HTTP Response header." },

  "400": { "message": "Bad Request", "description": "The server cannot or will not process the request due to something that is perceived to be a client error." },
  "401": { "message": "Unauthorized", "description": "The client must authenticate itself to get the requested response." },
  "402": { "message": "Payment Required (Unused)", "description": "This response code is reserved for future use." },
  "403": { "message": "Forbidden", "description": "The client does not have access rights to the content." },
  "404": { "message": "Not Found", "description": "The server cannot find the requested resource." },
  "405": { "message": "Method Not Allowed", "description": "The request method is known by the server but is not supported by the target resource." },
  "406": { "message": "Not Acceptable", "description": "This response is sent when the web server, after performing server-driven content negotiation, doesn't find any content that conforms to the criteria given by the user agent." },
  "407": { "message": "Proxy Authentication Required", "description": "This is similar to 401 Unauthorized but authentication is needed to be done by a proxy." },
  "408": { "message": "Request Timeout", "description": "This response is sent on an idle connection by some servers, even without any previous request by the client." },
  "409": { "message": "Conflict", "description": "This response is sent when a request conflicts with the current state of the server." },
  "410": { "message": "Gone", "description": "This response is sent when the requested content has been permanently deleted from server, with no forwarding address." },
  "411": { "message": "Length Required", "description": "Server rejected the request because the Content-Length header field is not defined and the server requires it." },
  "412": { "message": "Precondition Failed", "description": "The client has indicated preconditions in its headers which the server does not meet." },
  "413": { "message": "Payload Too Large", "description": "Request entity is larger than limits defined by server." },
  "414": { "message": "URI Too Long", "description": "The URI requested by the client is longer than the server is willing to interpret." },
  "415": { "message": "Unsupported Media Type", "description": "The media format of the requested data is not supported by the server, so the server is rejecting the request." },
  "416": { "message": "Range Not Satisfiable", "description": "The range specified by the Range header field in the request cannot be fulfilled." },
  "417": { "message": "Expectation Failed", "description": "This response code means the expectation indicated by the Expect request header field cannot be met by the server." },
  "418": { "message": "I'm a teapot (Unused)", "description": "The server refuses the attempt to brew coffee with a teapot." },
  "421": { "message": "Misdirected Request", "description": "The request was directed at a server that is not able to produce a response." },
  "422": { "message": "Unprocessable Content", "description": "The request was well-formed but was unable to be followed due to semantic errors." },
  "423": { "message": "Locked", "description": "The resource that is being accessed is locked." },
  "424": { "message": "Failed Dependency", "description": "The request failed due to failure of a previous request." },
  "425": { "message": "Too Early", "description": "Indicates that the server is unwilling to risk processing a request that might be replayed." },
  "426": { "message": "Upgrade Required", "description": "The server refuses to perform the request using the current protocol but might be willing to do so after the client upgrades to a different protocol." },
  "428": { "message": "Precondition Required", "description": "The origin server requires the request to be conditional." },
  "429": { "message": "Too Many Requests", "description": "The user has sent too many requests in a given amount of time." },
  "431": { "message": "Request Header Fields Too Large", "description": "The server is unwilling to process the request because its header fields are too large." },
  "451": { "message": "Unavailable For Legal Reasons", "description": "The user agent requested a resource that cannot legally be provided, such as a web page censored by a government." },

  "500": { "message": "Internal Server Error", "description": "The server has encountered a situation it does not know how to handle." },
  "501": { "message": "Not Implemented", "description": "The request method is not supported by the server and cannot be handled." },
  "502": { "message": "Bad Gateway", "description": "This error response means that the server, while working as a gateway to get a response needed to handle the request, got an invalid response." },
  "503": { "message": "Service Unavailable", "description": "The server is not ready to handle the request. Common causes are a server that is down for maintenance or that is overloaded." },
  "504": { "message": "Gateway Timeout", "description": "This error response is given when the server is acting as a gateway and cannot get a response in time." },
  "505": { "message": "HTTP Version Not Supported", "description": "The HTTP version used in the request is not supported by the server." },
  "506": { "message": "Variant Also Negotiates", "description": "The server has an internal configuration error." },
  "507": { "message": "Insufficient Storage", "description": "The method could not be performed on the resource because the server is unable to store the representation needed to successfully complete the request." },
  "508": { "message": "Loop Detected", "description": "The server detected an infinite loop while processing the request." },
  "510": { "message": "Not Extended", "description": "Further extensions to the request are required for the server to fulfill it." },
  "511": { "message": "Network Authentication Required", "description": "Indicates that the client needs to authenticate to gain network access." }
}